# a = 5  этот метод называется  int чиловой 
# b = "hello" этот метод называется  str строчный
# c = 5.55 этот метод называется  floot числовой с плавающей строкой
# d = True  этот метод называется  bool правда или ложь


# m = [34, 'hello', True] тип данный list-список!!

# v = {'fk':45, 54:'ytr', 'disck':[45,66,76,33]}  тип данных dict - словарь

# c = (4, 'hello', True) тип данных не изменяемый tuble - кортеж

# x = {45, 334, 'ghdjksl', True} тип данных set- множество

# print(f"{m} \n{v}\n{c}\n{x}")











# user = "Hello, Jhon kvjuoe rr"

#print(n.replace('Jhon','Gulimira))


#print(user.capitalize()) #метод  для увелечения заглавных сиволов

# print(user.title()) метод  для увелечения первого символа символов 

# m = 12.7

#print(m//3) #метод вывод целого числа после деления

# print(m%3) метод вывода остатка

# print(m**2) метод возведения в степень

# print(abs(m)) метод воозращения обсолютное значения 

# print(round(m)) метод округления числа

# a = int(input("Введите первое число"))
# b = int(input("Введите второе число"))
# c = a + b
# print(c)

# a = int(input("Введите первое число"))
# b = int(input("Введите второе число"))
# c = a * b
# print(c)

# s = str(input("как вас зовут?   "))
# d = str(input("введите фамилию  "))
# print(f" привет {s} {d} как дела?")